{
    "biceps": [
      {
        "name": "Bicep Curl",
        "calories_burned_per_min": 6,
        "equipment": "Dumbbell",
        "details": "Hold the barbell with both hands facing up so the wrists, elbows, and shoulders are in a straight line about shoulder-width apart. Lift the barbell toward the shoulders while bending the elbows and keeping them next to the middle of the body. Slowly lower the weight to return to the starting position. Keep chest still, using just the arms for the movement."
      },
      {
        "name": "bent-Over Row",
        "calories_burned_per_min": 5.5,
        "equipment": "Barbell",
        "details": "Grip a barbell with palms down so that the wrists, elbows, and shoulders are in a straight line. Lift the bar from the rack, bend forward at the hips, and keep the back straight with a slight bend in the knees. Lower the bar towards the floor until the elbows are completely straight, and keep the back flat as the bar is pulled towards the belly button. Then slowly lower the bar to the starting position and repeat."
      },
      {
        "name": "Rotational Uppercut",
        "calories_burned_per_min": 6.5,
        "equipment": "Dumbbell",
        "details": "Stand with the feet hip-width apart, hold one dumbbell in each hand with the palms facing up, and the elbows close to the rib cage. Sink back into the hips and press the left foot into the ground to turn to the right, keep the left elbow bent and perform an uppercut with the left arm, bringing the left elbow to shoulder-height. Slowly lower the left arm and turn back to the center. Push the right foot into the ground to turn the left hip while swinging the right arm up in an uppercut."
      },
      {
        "name": "Standing Biceps Curl",
        "calories_burned_per_min": 7,
        "equipment": "Resistance Bands/Cables",
        "details": "Place the center of a resistance band under one foot and grasp the handles with one in each hand. With the palms facing the ceiling, bend the elbows to bring the hands up toward the shoulders. Keep the elbows in close to the sides through the movement, and lower slowly back down to complete the repetition."
      }
    ],
    "triceps": [
        {
            "name": "Tricep Extension",
            "calories_burned_per_min": 6,
            "equipment": "Dumbbell",
            "details": "Adjust the seat to a comfortable height and the weight to the appropriate level before beginning. Sitting with a tall back, rest the upper arms on the pad and grasp the handles. Keeping the elbows in a straight line with the shoulders, press the hands downward. Slowly return to the starting position."
        },
        {
            "name": "Tricep Pressdown",
            "calories_burned_per_min": 6.5,
            "equipment": "Resistance Bands/Cables",
            "details": "Stand with the feet hip-width apart, the hips straight, the back tall, and the knees slightly bent. Place the cable pulley at about shoulder-height and attach a rope handle. Grip the rope with both hands and pull it down towards the thighs while keeping the elbows close to the body. Pause for one second before slowly returning to the starting position.",
            "image": [
                "/static/images/tricepPress1.jpg",
                "/static/images/tricepPress2.jpg"
            ]
        },
        {
            "name": "Skull Crusher",
            "calories_burned_per_min": 6,
            "equipment": "Barbell",
            "details": "Lie on a flat bench with the feet flat on the floor and the knees bent. Hold a barbell with both hands, palms facing up, and extend the arms straight up towards the ceiling. Slowly lower the barbell towards the forehead by bending the elbows, keeping the upper arms still. Pause for one second before slowly returning to the starting position."
        },
        {
            "name": "Tricep Kickback",
            "calories_burned_per_min": 6.5,
            "equipment": "Dumbbell",
            "details": "Stand with the feet hip-width apart, the hips straight, the back tall, and the knees slightly bent. Hold a dumbbell in each hand with the palms facing in. Bend forward at the hips and keep the back straight. Bend the elbows to bring the dumbbells up towards the shoulders, then straighten the arms behind the body while keeping the elbows close to the sides. Pause for one second before slowly returning to the starting position."
        }
    ],
    "chest": [
      {
        "name": "Close-grip Bench Press",
        "calories_burned_per_min": 7,
        "equipment": "Barbell",
        "details": "Lie face up on a barbell bench, then reach up and grip the bar with the hands directly in line with the shoulders and the elbows pointed towards the feet. Unrack the bar and bring it towards the chest by bending the elbows and keeping them close to the ribs. Push the feet into the floor, and press the hips into the bench as the bar is pushed away from the chest to return to the starting position."
      },
      {
        "name": "Plank-Ups",
        "calories_burned_per_min": 6.5,
        "equipment": "No Equipment",
        "details": "Start in a push-up position with the hands under the shoulders and the legs stretched out directly behind. Squeeze the thigh and glute muscles to keep body and legs in a straight line, and lower down to the elbows one elbow at a time. From this position on the elbows, press the hands into the floor one at a time to return to the push-up position."
      },
      {
        "name": "Push-up with Staggered Hands",
        "calories_burned_per_min": 6,
        "equipment": "No Equipment",
        "details": "Start in a push-up position with the hands wider than shoulder-width apart and the legs straight out directly behind the body about hip-width apart. Squeeze the thighs and glutes while moving the right hand forward a couple of inches and the left hand out a couple of inches to the left side. This will create an uneven hand position. Slowly lower the body toward the ground then back up to return to the starting position."
      },
      {"name": "Single-arm Chest Press",
        "calories_burned_per_min": 6.5,
        "equipment": "Resistance Bands/Cables",
        "details": "Stand with the feet hip-width apart, the hips straight, the back tall, and the knees slightly bent. Place the pulley at shoulder-height, and use a single handle. Turn so that the back is towards the machine and the right arm is directly in front of the pulley. Grip the handle in the right hand with the palm facing down. Press both feet into the floor, squeeze the stomach, and straighten the arm. Pause at the end for one second before slowly bringing the arm back to lower the weight."
      }
    ],
    "back": [
    {
        "name": "High-Row",
        "calories_burned_per_min": 6,
        "equipment": "Resistance Bands/Cables",
        "details": "Stand with the feet hip-width apart, the hips straight, the back tall, and the knees slightly bent. Place the cable pulley at about shoulder-height, attach a rope handle, and hold one end of the rope in each hand with the palms facing down. Turn to face the machine. Lift the chest up and pull the elbows back until the hands are right in front of the shoulders, then pause for 2-3 seconds. Slowly straighten the arms to return the weight to the starting position."
    },
    {
        "name": "Reverse Fly",
        "calories_burned_per_min": 6.5,
        "equipment": "Resistance Bands/Cables",
        "details": "Place two cable pulleys at about shoulder-height (or slightly below) and stand so that each pulley is on either side of the body. With the left hand, grab the handle from the pulley on the right side of the body. With the right hand, grab the pulley on the left, starting the exercise with both arms crossed in front of the body. Keep the back straight, press the feet into the floor, and spread both arms apart until they are in a straight line. Pause before slowly returning to the starting position."
    },
    {
        "name": "Single Arm Row",
        "calories_burned_per_min": 6,
        "equipment": "Resistance Bands/Cables",
        "details": "Stand with the feet hip-width apart.  Keep the hips straight, the back tall, and the knees slightly bent. Attach a single handle to the cable pulley and press feet into the floor while pulling the cable back towards the body with the left hand. At the end of the movement pause for a second before slowly straightening the left arm to lower the weight to the starting position."
    },
    {
        "name": "Seated Cable Row",
        "calories_burned_per_min": 6.5,
        "equipment": "Resistance Bands/Cables",
        "details": "Use a seated pulley cable machine and a narrow handle, and place the feet on the floor with knees bent and maintain a straight back. Hold the handle and lift the chest while slowly pulling the elbows backwards close to the rib cage until the handle touches the front of the stomach. Pause for one second before slowly straightening the arms to return the weight to the original starting position."
    }
    ],
    "shoulder": [
        {
            "name": "Bottom-up Press",
            "calories_burned_per_min": 6,
            "equipment": "KettleBells",
            "details": "Stand with the feet hip-width apart, the hips straight, the back tall, and the knees slightly bent. Hold a kettlebell in one hand with the palm facing up and the elbow bent at 90 degrees. Press the kettlebell up towards the ceiling while keeping the elbow bent. Pause for one second before slowly lowering the kettlebell back to the starting position."
        },
        {
            "name": "Diagonal Raise",
            "calories_burned_per_min": 6.5,
            "equipment": "Dumbbell",
            "details": "Stand with the feet hip-width apart, hold one dumbbell in the left hand with the left arm down straight and the left palm resting in front of the right thigh. Press the feet into the ground, keep the hips straight and the back tall. Raise the left arm across the body and out to the left side so that the weight is brought up to shoulder-height and the arm is kept straight."
        },
        {
            "name": "Halo",
            "calories_burned_per_min": 6,
            "equipment": "KettleBells",
            "details": "Stand with the feet approximately shoulder-width apart and hold a kettlebell by the horns directly in front of the chest. Keep the back straight while moving the kettlebell from in front of the chest to over the right shoulder, reaching across the body with the left arm. Continue moving the kettlebell around and behind the head to bring it back to the chest by passing it over the left shoulder. Continue for the desired number of repetitions before switching directions."
        },
        {
            "name": "Rotator Cuff External Rotation",
            "calories_burned_per_min": 6,
            "equipment": "Resistance Bands/Cables",
            "details": "Place a cable pulley at about waist-height and attach a single handle, holding it in the left hand so that the right side of the body is closest to the machine. Keep the left elbow tucked in to the body, and turn the shoulder back away from the body to move the left hand to the outside of the body (the cable should pass in front of the stomach). Pause for one second before slowly lowering the weight to the starting position. Switch sides and repeat."
        }
    ]
}